---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AllModelTypeComments
source: html/1abba00e-5078-e3ef-8f29-a7ed7583a697.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AllModelTypeComments Property

"Type Comments"

## Syntax (C#)
```csharp
public static ForgeTypeId AllModelTypeComments { get; }
```